Repository: Belarus/OmegaT-Android
Catalog: Android/omegat/project_save.tmx
Source language: en
Languages: be

source: Allows an application to monitor and control how the system launches activities.
be: Дазваляе праґраме сачыць і кіраваць, як сыстэма запускае дзейнасьці.

source: Allows an application to monitor and control how the system launches activities. Malicious applications may completely compromise the system. This permission is only needed for development, never for normal phone usage.
be: Дазваляе праґраме сачыць і кіраваць, як сыстэма запускае дзейнасьці. Зламысныя праґрамы могуць паставіць сыстэму ў рызыку. Гэты дазвол патрабуецца толькі каб распрацоўваць, і ніколі не патрэбны ў звычайных умовах.

source: Allows an application to move application resources from internal to external media and vice versa.
be: Дазваляе праґраме перасоўваць ейныя запасы з унутранага сховішча ў вонкавае ды наадварот.

source: Allows an application to move tasks to the foreground and background.
be: Дазваляе праґраме перасоўваць задачы на пярэдні ці на задні плян.

source: Allows an application to move tasks to the foreground and background. Malicious applications can force themselves to the front without your control.
be: Дазваляе праґраме перасоўваць задачы на пярэдні ці на задні плян. Зламысныя праґрамы могуць не падпарадкоўвацца вашым загадам і прымусова трымацца наперадзе.

source: Allows an application to override the power key
be: Дазваляе праґраме пераважаць над кнопкаю сілкаваньня.

source: Allows an application to perform operations like adding, and removing accounts and deleting their password.
be: Дазваляе праґраме выконваць дзеяньні накшталт дадаваць, выкрасьляць рахункі ды сьціраць іхнія паролі.

source: Allows an application to prevent the phone from going to sleep.
be: Дазваляе праґраме не дапускаць, каб тэлефон засынаў.

source: Allows an application to prevent the tablet from going to sleep.
be: Дазваляе праґраме не дапускаць, каб пляншэт засынаў.

source: Allows an application to read all calendar events stored on your phone, including those of friends or coworkers.
be: Дазваляе праґраме зьмяняць падзеі календара, якія захоўваюцца на тэлефоне, у тым ліку пералік сяброў і супрацоўнікаў.

source: Allows an application to read all calendar events stored on your tablet, including those of friends or coworkers.
be: Дазваляе праґраме зьмяняць падзеі календара, якія захоўваюцца на пляншэце, у тым ліку пералік сяброў і супрацоўнікаў.

source: Allows an application to read all of the calendar events stored on your phone.
be: Дазваляе праґраме чытаць усе падзеі календара, якія захоўваюцца на тэлефоне.

source: Allows an application to read all of the calendar events stored on your phone. Malicious applications can use this to send your calendar events to other people.
be: Дазваляе праґраме чытаць усе падзеі календара, якія захоўваюцца на тэлефоне. Зламысныя праґрамы могуць карыстацца гэтым, каб дасылаць падзеі вашага календара іншым людзям.

source: Allows an application to read all of the contact (address) data stored on your phone.
be: Дазваляе праґраме чытаць усе зьвесткі кантактаў (адрасоў), якія захоўваюцца на тэлефоне.

source: Allows an application to read all of the contact (address) data stored on your phone. Malicious applications can use this to send your data to other people.
be: Дазваляе праґраме чытаць усе зьвесткі кантакту (адрас), якія захоўваюцца на вашым тэлефоне. Зламысныя праґрамы могуць карыстацца гэтым, каб дасылаць вашыя зьвесткі іншым людзям.

source: Allows an application to read all of the contact (address) data stored on your tablet.
be: Дазваляе праґраме чытаць усе зьвесткі кантактаў (адрасоў), якія захоўваюцца на пляншэце.

source: Allows an application to read and write the cache filesystem.
be: Дазваляе праґраме чытаць і запісваць на файлавае сыстэме запасьніку.

source: Allows an application to read and write to any resource owned by the diag group; for example, files in /dev.
be: Дазваляе праґраме чытаць і запісваць хоць-якія крыніцы, якія належаць суполцы дыягностыкі «diag»: прыкладам, файлы ў каталёґу «/dev».

source: Allows an application to read and write to any resource owned by the diag group; for example, files in /dev. This could potentially affect system stability and security. This should be ONLY be used for hardware-specific diagnostics by the manufacturer or operator.
be: Дазваляе праґраме чытаць і запісваць хоць-якія крыніцы, якія належаць суполцы «diag»: прыкладам, файлы ў каталёґу «/dev». Гэта можа паўплываць на ўстойлівасьць ды бясьпеку сыстэмы. Такі дазвол мусіць выкарыстоўвацца ТОЛЬКІ ў адмысловае дыягностыцы абсталяваньня апэратарам або вытворцам.

source: Allows an application to read any private words, names and phrases that the user may have stored in the user dictionary.
be: Дазваляе праґраме чытаць усе асабістыя словы, імёны ды выразы, якія карыстальнік мог захаваць у слоўніку карыстальніка.

source: Allows an application to read from the system's various log files.
be: Дазваляе праґраме чытаць файлы розных справаздачаў сыстэмы.

source: Allows an application to read from the system\'s various log files. This allows it to discover general information about what you are doing with the phone, but they should not contain any personal or private information.
be: Дазваляе праґраме чытаць файлы розных справаздачаў сыстэмы. Гэта дазваляе выяўляць агульныя зьвесткі пра тое, што вы робіце на тэлефоне, але справаздачы мусяць не зьмяшчаць ніякіх асабістых зьвестак.

source: Allows an application to read historical network usage for specific networks and applications.
be: Дазваляе праґраме чытаць гісторыю выкарыстаньня пэўных сетак пэўнымі праґрамамі.

source: Allows an application to read the settings and shortcuts in Home.
be: Дазваляе праґраме чытаць налады ды выклічнікі хатняга экрану.

source: Allows an application to read the sync settings, such as whether sync is enabled for Contacts.
be: Дазваляе праґраме чытаць налады сынхранізаваньня, кшталту таго, ці сынхранізуюцца Кантакты.

source: Allows an application to read the sync stats; e.g., the history of syncs that have occurred.
be: Дазваляе праґраме чытаць статыстыку сынхранізаваньня; напрыклад, гісторыю сынхранізаваньняў.

source: Allows an application to receive packets not directly addressed to your device.
be: Дазваляе праґраме атрымваць пакеты, якія не адрасаваліся наўпрост вашае прыладзе.

source: Allows an application to receive packets not directly addressed to your device. This can be useful when discovering services offered near by. It uses more power than the non-multicast mode.
be: Дазваляе праґраме атрымваць пакеты, якія не адрасаваліся наўпрост вашае прыладзе. Гэта можа быць карысным, каб выявіць, якія службы прапануюцца блізу вас. Гэта карыстае энэргіі болей за не бязадрасны стан.

source: Allows an application to remove shortcuts without user intervention.
be: Дазваляе праґраме выкрасьляць выклічнікі без умяшаньня карыстальніка.

source: Allows an application to remove tasks and kill their applications.
be: Дазваляе праґраме спыняць задачы ды забіваць адпаведныя праґрамы.

source: Allows an application to request authentication tokens.
be: Дазваляе праґраме запытвацца на апазнавальныя прыкметы.

source: Allows an application to retrieve its code, data, and cache sizes
be: Дазваляе праґраме атрымваць памер ейнага коду, дадзеных і запасьніку.

source: Allows an application to send event invitations as the calendar owner and add, remove, change events that you can modify on your device, including those of friends or co-workers.
be: Дазваляе праґраме зьмяняць дасылаць запрашэньні ад імя ўладальніка календара, дадаваць, прыбіраць падзеі, якія можна зьмяняць на гэтае прыладзе, у тым ліку пералік сяброў і супрацоўнікаў.

source: Allows an application to send sticky broadcasts, which remain after the broadcast ends.
be: Дазваляе праґраме дапісваць рабіць нетэрміновыя рассылкі, якія засталіся, калі скончылі дадзеную рассылку.

source: Allows an application to show system alert windows.
be: Дазваляе праґраме паказваць вокны сыстэмных папярэджаньняў.

source: Allows an application to show system alert windows. Malicious applications can take over the entire screen of the phone.
be: Дазваляе праґраме паказваць вокны сыстэмных папярэджаньняў. Зламысныя праґрамы могуць захапіць увесь экран тэлефону.

source: Allows an application to turn on debugging for another application.
be: Дазваляе праґраме задзейнічаць наладку іншае праґрамы.

source: Allows an application to turn on debugging for another application. Malicious applications can use this to kill other applications.
be: Дазваляе праґраме задзейнічаць наладку іншае праґрамы. Зламысныя праґрамы могуць карыстацца гэтым, каб забіваць іншыя праґрамы.

source: Allows an application to use the SIP service to make/receive Internet calls.
be: Дазваляе праґраме выклікаць і прымаць выклікі празь сеціва з дапамогаю адпаведнае службы — SIP.

source: Allows an application to use the account authenticator capabilities of the AccountManager, including creating accounts and getting and setting their passwords.
be: Дазваляе праґраме выкарыстоўваць апазнавальныя ўласьцівасьці кіраўніка рахункаў, у тым ліку здольнасьць ствараць рахункі, атрымваць і вызначаць іхнія паролі.

source: Allows an application to view configuration of the local Bluetooth phone, and to make and accept connections with paired devices.
be: Дазваляе праґраме глядзець настаўленьні ўласнага Bluetooth тэлефона, ствараць ды прымаць злучэньні са спалучанымі прыладамі.

source: Allows an application to view configuration of the local Bluetooth tablet, and to make and accept connections with paired devices.
be: Дазваляе праґраме глядзець настаўленьні ўласнага Bluetooth пляншэта, ствараць ды прымаць злучэньні са спалучанымі прыладамі.

source: Allows an application to view the information about the state of Wi-Fi.
be: Дазваляе праґраме глядзець зьвесткі пра стан Wi-Fi.

source: Allows an application to view the information about the state of WiMAX.
be: Дазваляе праґраме глядзець зьвесткі пра стан WiMAX.

source: Allows an application to view the state of all networks.
be: Дазваляе праґраме глядзець стан усіх сетак.

source: Allows an application to write new words into the user dictionary.
be: Дазваляе праґраме дапісваць новыя словы ў слоўнік карыстальніка.

source: Allows an application to write to the SD card.
be: Дазваляе праґраме запісваць на картку SD.

source: Allows an application to write to the USB storage.
be: Дазваляе праґраме запісваць у сховішча USB.

source: Allows application to access the audio record path.
be: Дазваляе праґраме доступ да шляху запісваць гук.

source: Allows application to disable the status bar or add and remove system icons.
be: Дазваляе праґраме прыбіраць паліцу стану, або дадаваць і прыбіраць сыстэмныя значкі.

source: Allows application to expand or collapse the status bar.
be: Дазваляе праґраме разгортваць або згортваць паліцу стану.

source: Allows application to modify global audio settings such as volume and routing.
be: Дазваляе праґраме зьмяняць агульныя налады гуку, кшталту гучнасьці ды накіроўваньня.

source: Allows application to process outgoing calls and change the number to be dialed.
be: Дазваляе праґраме апрацоўваць выходныя выклікі ды зьмяняць нумар, які набіраецца.

source: Allows application to process outgoing calls and change the number to be dialed. Malicious applications may monitor, redirect, or prevent outgoing calls.
be: Дазваляе праґраме апрацоўваць выходныя выклікі ды зьмяняць нумар, які набіраецца. Зламысныя праґрамы могуць сачыць, перанакіроўваць або затрымваць выходныя выклікі.

source: Allows application to read SMS messages stored on your phone or SIM card.
be: Дазваляе праґраме чытаць паведамленьні SMS, якія захоўваюцца на тэлефоне або на картцы SIM.

source: Allows application to read SMS messages stored on your phone or SIM card. Malicious applications may read your confidential messages.
be: Дазваляе праґраме чытаць паведамленьні SMS, якія захоўваюцца на вашым тэлефоне або картцы SIM. Зламысныя праґрамы могуць чытаць вашыя асабістыя паведамленьні.

source: Allows application to read SMS messages stored on your tablet or SIM card.
be: Дазваляе праґраме чытаць паведамленьні SMS, якія захоўваюцца на пляншэце або на картцы SIM.

source: Allows application to read the content of the frame buffer.
be: Дазваляе праґраме чытаць зьмесьціва буфэру кадраў.

source: Allows application to receive and process MMS messages.
be: Дазваляе праґраме атрымваць і апрацоўваць паведамленьні MMS.

source: Allows application to receive and process MMS messages. Malicious applications may monitor your messages or delete them without showing them to you.
be: Дазваляе праґраме атрымваць і апрацоўваць паведамленьні MMS. Зламысныя праґрамы могуць сачыць за вашымі паведамленьнямі ды выдаляць іх, не паказваючы іх вам.

source: Allows application to receive and process SMS messages.
be: Дазваляе праґраме атрымваць і апрацоўваць паведамленьні SMS.

source: Allows application to receive and process SMS messages. Malicious applications may monitor your messages or delete them without showing them to you.
be: Дазваляе праґраме атрымваць і апрацоўваць паведамленьні SMS. Зламысныя праґрамы могуць сачыць за вашымі паведамленьнямі ды выдаляць іх, не паказваючы іх вам.

source: Allows application to receive and process WAP messages.
be: Дазваляе праґраме атрымваць і апрацоўваць паведамленьні WAP.

source: Allows application to receive and process WAP messages. Malicious applications may monitor your messages or delete them without showing them to you.
be: Дазваляе праґраме атрымваць і апрацоўваць паведамленьні WAP. Зламысныя праґрамы могуць сачыць за вашымі паведамленьнямі ды выдаляць іх, не паказваючы іх вам.

source: Allows application to receive and process emergency broadcast messages.
be: Дазваляе праґраме атрымваць і апрацоўваць паведамленьні надзвычайнага апавяшчэньня.

source: Allows application to request that the supplied signal be sent to all persistent processes.
be: Дазваляе праґраме запытвацца, каб даслаць прапанаваны сыґнал усім сталым працэсам.

source: Allows application to retrieve information about currently and recently running tasks.
be: Дазваляе праґраме атрымваць зьвесткі пра задачы, якія зараз выконваюцца або нядаўна запускаліся.

source: Allows application to retrieve information about currently and recently running tasks. May allow malicious applications to discover private information about other applications.
be: Дазваляе праґраме атрымваць зьвесткі пра задачы, якія зараз выконваюцца або нядаўна запускаліся. Можа дазволіць зламысным праґрамам выявіць асабістыя зьвесткі пра іншыя праґрамы.

source: Allows application to retrieve internal state of the system.
be: Дазваляе праґраме атрымваць унутраны стан сыстэмы.

source: Allows application to retrieve internal state of the system. Malicious applications may retrieve a wide variety of private and secure information that they should never normally need.
be: Дазваляе праґраме атрымваць унутраны стан сыстэмы. Зламысныя праґрамы могуць атрымваць разнастайныя асабістыя зьвесткі і зьвесткі бясьпекі, якія яны звычайна ня мусяць патрабаваць.

source: Allows application to retrieve the content of the active window.
be: Дазваляе праґраме атрымваць зьмесьціва бягучага вакна.

source: Allows application to send SMS messages.
be: Дазваляе праґраме дасылаць паведамленьні SMS.

source: Allows application to send SMS messages. Malicious applications may cost you money by sending messages without your confirmation.
be: Дазваляе праґраме дасылаць паведамленьні SMS. Зламысныя праґрамы могуць каштаваць вам грошай, дасылаючы паведамленьні бяз вашае згоды.

source: Allows application to take pictures and videos with the camera.
be: Дазваляе праґраме здымаць фота ды відэа з дапамогаю камэры.

source: Allows application to take pictures with the camera.
be: Дазваляе праґраме рабіць здымкі з дапамогаю камэры.

source: Allows application to take pictures with the camera. This allows the application at any time to collect images the camera is seeing.
be: Дазваляе праґраме рабіць здымкі з дапамогаю камэры. Гэта дазваляе праґраме ў хоць-які час атрымваць выявы, якія бачыць камэра.

source: Allows application to use SurfaceFlinger low-level features.
be: Дазваляе праґраме выкарыстоўваць функцыі SurfaceFlinger нізкага ўзроўню.

source: Allows application to write to SMS messages stored on your phone or SIM card.
be: Дазваляе праґраме правіць паведамленьні SMS, якія захоўваюцца на тэлефоне або на картцы SIM.

source: Allows application to write to SMS messages stored on your phone or SIM card. Malicious applications may delete your messages.
be: Дазваляе праґраме рэдаґаваць паведамленьні SMS, якія захоўваюцца на вашым тэлефоне або картцы SIM. Зламысныя праґрамы могуць выдаліць вашыя паведамленьні.

source: Allows application to write to SMS messages stored on your tablet or SIM card.
be: Дазваляе праґраме правіць паведамленьні SMS, якія захоўваюцца на тэлефоне або на картцы SIM.

source: Allows applications direct access to the passwords for the Google account(s) you have configured.
be: Дае праґрамам наўпроставы доступ да пароляў на настаўленыя рахункі Google.

source: Allows applications to access the contacts and profile information of account(s) stored on this phone.
be: Дае праґрамам доступ да зьвестак профілю ды кантактаў рахунку (або рахункаў), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to create and manage their own tokens, bypassing their normal Z-ordering.
be: Дазваляе праґрамам ствараць і кіраваць іхнімі ўласнымі прыкметамі, не зважаючы на іхняе звычайнае Z-парадакваньне.

source: Allows applications to create and manage their own tokens, bypassing their normal Z-ordering. Should never be needed for normal applications.
be: Дазваляе праґрамам ствараць і кіраваць іхнімі ўласнымі прыкметамі, не зважаючы на іхні звычайны Z-парадакваньне. Звычайныя праґрамы ня мусяць патрабаваць гэтае магчымасьці.

source: Allows applications to read data from the Google Talk content provider.
be: Дазваляе праґрамам чытаць дадзеныя пастаўніка зьмесьціва Гутаркі Google.

source: Allows applications to see the YouTube username(s) associated with the Google account(s) stored on this phone.
be: Дазваляе праґрамам праглядаць імя (або імёны) карыстальнікаў, зьвязаныя з рахункам (або рахункамі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to see the usernames (email addresses) of the Google account(s) you have configured.
be: Дазваляе праґрамам глядзець імёны карыстальнікаў (адрасы эл. пошты)настаўленых рахункаў Google.

source: Allows applications to sign in to ALL Google services using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць ува ЎСЕ службы Google праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to Android services using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у службы Android праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to Blogger using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у Блоґер праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to Google Calendar using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у Каляндар Google праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to Google Checkout (and potentially make purchases) using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у Касу Google (што дазваляе купляць) праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to Google Talk using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у Гутарку Google праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to Google mail services using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у службы пошты Google праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to Google mobile applications using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у перасоўныя праґрамы Google праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to Picasa Web Albums using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у сеціўныя альбомы Picasa праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to YouTube using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у YouTube праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to iGoogle using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у iGoogle праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to sign in to unspecified Google services using the account(s) stored on this phone.
be: Дазваляе праґрамам уваходзіць у нявызначаныя службы Google праз рахунак (або рахункі), якія захоўваюцца на гэтым тэлефоне.

source: Allows applications to switch the phone between \"Gmail\" and \"Google Mail\" branding.
be: Дазваляе праґрамам абіраць, якую марку ўжываць на тэлефоне: «Gmail», або «Пошта Google».

source: Allows applications to watch the keys you press even when interacting with another application (such as entering a password).
be: Дазваляе праґраме сачыць, якія клявішы вы націскаеце нат калі вы ўзаемадзейнічаеце зь іншаю праґрамаю (напрыклад, упісваеце пароль).

source: Allows applications to watch the keys you press even when interacting with another application (such as entering a password). Should never be needed for normal applications.
be: Дазваляе праґраме сачыць, якія клявішы вы націскаеце нат калі вы ўзаемадзейнічаеце зь іншаю праґрамаю (напрыклад, упісваеце пароль). Звычайныя праґрамы ня мусяць патрабаваць гэтае магчымасьці.

source: Allows applications to write data to the Google Talk content provider.
be: Дазваляе праґрамам запісваць дадзеныя пастаўніка зьмесьціва Гутаркі Google.

source: Allows bouncy scrolling desktop screens
be: Дазваляе спружыніць, гартаючы экраны стальніцаў

source: Allows enabling/disabling location update notifications from the radio.
be: Дазваляе задзейнічаць або забараніць спавяшчэньні (па радыёсувязі) пра зьмяненьне месцазнаходжаньня.

source: Allows enabling/disabling location update notifications from the radio. Not for use by normal applications.
be: Дазваляе задзейнічаць або забараніць спавяшчэньні (па радыёсувязі) пра зьмяненьне месцазнаходжаньня. Звычайнымі праґрамамі не выкарыстоўваецца.

source: Allows modification of how network usage is accounted against applications.
be: Дазваляе зьмяняць, якім чынам сетка выкарыстоўваецца праґрамамі.

source: Allows read and write for revoked permissions.
be: Дазваляе чытаць і запісваць скасаваныя дазволы.

source: Allows read/write access to properties uploaded by the checkin service.
be: Дазваляе чытаць і запісваць уласьцівасьці, запампаваныя службаю адзначацца.

source: Allows the app to access the BluetoothShare manager and use it to transfer files.
be: Дазваляе праґраме мець доступ да кіраўніка дзяліцца па Bluetooth і перадаваць празь яго файлы.

source: Allows the application to accept cloud to device messages from application's service
be: Дазваляе праґраме прымаць паведамленьні ад воблака да прылады ад службы праґрамы

source: Allows the application to access and sync social updates from you and your friends.
be: Дазваляе праґраме атрымваць доступ і сынхранізаваць грамадзкія абнаўленьні — вашыя ды вашых сяброў.
